index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-07-25 Thu 11:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Low Level API - for STM32F1 chips</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="the LL API for the STM32F1. Extracted from the STM32 Cube HAL and wrapped in CMake for convenience"
>
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=".."> UP </a>
 |
 <a accesskey="H" href=".."> HOME </a>
</div><div id="content">
<h1 class="title">Low Level API - for STM32F1 chips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f91eb2">Intro</a></li>
<li><a href="#org8de9a58">Removing the HAL</a></li>
<li><a href="#orgb25c9c9">Adding the CMSIS</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2f91eb2" class="outline-2">
<h2 id="org2f91eb2">Intro</h2>
<div class="outline-text-2" id="text-org2f91eb2">
<p>
The STM32 Low Level API is an API provided as a part of the STM32 Cube HAL. It's inconvenient to get from the STM32 website, so I'm providing an easy to access copy here that is built without the HAL using CMake. Below I describe how I created this.
</p>
</div>
</div>

<div id="outline-container-org8de9a58" class="outline-2">
<h2 id="org8de9a58">Removing the HAL</h2>
<div class="outline-text-2" id="text-org8de9a58">
<p>
<b>Note:</b> The STM32 Cube HAL is under a BSD license (per the documentation)
</p>

<p>
To start I took the HAL as provided by STM on <a href="https://www.st.com/content/st_com/en/products/embedded-software/mcus-embedded-software/stm32-embedded-software/stm32cube-mcu-packages/stm32cubef1.html">their website</a>. Then I copied all the <code>stm32f1xx_ll_*.c</code> files from <code>STM32Cube_FW_F1_V1.6.0/Drivers/STM32F1xx_HAL_Driver/Src</code> over to the <code>src</code> folder and added them to library
</p>

<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #006699;">cmake_minimum_required</span>(VERSION 3.0)

<span style="color: #006699;">add_library</span>(ll
  src/stm32f1xx_ll_utils.c
  src/stm32f1xx_ll_usb.c
  src/stm32f1xx_ll_usart.c
  src/stm32f1xx_ll_tim.c
  src/stm32f1xx_ll_spi.c
  src/stm32f1xx_ll_sdmmc.c
  src/stm32f1xx_ll_rtc.c
  src/stm32f1xx_ll_rcc.c
  src/stm32f1xx_ll_pwr.c
  src/stm32f1xx_ll_i2c.c
  src/stm32f1xx_ll_gpio.c
  src/stm32f1xx_ll_fsmc.c
  src/stm32f1xx_ll_exti.c
  src/stm32f1xx_ll_dma.c
  src/stm32f1xx_ll_dac.c
  src/stm32f1xx_ll_crc.c
  src/stm32f1xx_ll_adc.c)
</pre>
</div>

<p>
Next I copied over their equivalent headers from <code>STM32Cube_FW_F1_V1.6.0/Drivers/STM32F1xx_HAL_Driver/Inc</code> over to the <code>inc</code> folder. B/c of how the Low Level API is configured I needed to also copy 3 extra files: 
</p>

<ul class="org-ul">
<li><code>stm32f1xx_hal.h</code></li>
<li><code>stm32f1xx_hal_def.h</code></li>
<li><code>stm32f1xx_hal_conf_template.h</code> which was copied over as <code>stm32f1xx_hal_conf.h</code></li>
</ul>

<p>
In this new <code>stm32f1xx_hal_conf.h</code> I then went to the <b>Module Selection</b> section at the top and comment out all the HAL modules starting from <code>#define HAL_MODULE_ENABLED</code> to completely disable the <code>HAL</code>. Next, per <a href="https://www.purplealienplanet.com/node/69">these instruction</a> I add a <code>#include "stm32f1xx_hal_def.h</code> somewhere a the top in this same file
</p>

<p>
Once that's all done I could add these LL-API headers
</p>

<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #006699;">target_include_directories</span>(ll PUBLIC inc)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb25c9c9" class="outline-2">
<h2 id="orgb25c9c9">Adding the CMSIS</h2>
<div class="outline-text-2" id="text-orgb25c9c9">
<p>
The CMSIS (Cortex Microcontroller Software Interface Standard) is the standard interface API for all ARM chips. It's common across all ARM vendors and STM's LL is build on top of this common layer. The CMSIS is also provided to us with the <b>STM Cube HAL</b> we downloaded - under <code>STM32Cube_FW_F1_V1.6.0/Drivers/CMSIS</code>. I copied this one over in its entirety. 
</p>

<p>
<b>Note:</b> The CMSIS is under the Apache 2.0 license
</p>

<p>
Naturally ARM boards are all quite different internally, including all the boards in the STM32 family. They will have different amount of space, different peripherals available and different memory layouts. So to have a common API and to enable the programmer to program once and run on all ARM chips you also need certain parts tailored to the particular chip. These configurations for the F1 family of chips are all located in <code>CMSIS/Device/ST/STM32F1xx/Include/</code> and as you can see - even withing one chip-type each chip has it's own configration file. These files will assign generic ARM variables like GPIOA<sub>BASE</sub> to actual memory location for <i>this particular chip</i>. So once we use the CMSIS we can program directly with these labels, like GPIO<sub>BASE</sub>, and under the hood - as long as you point at the right configuration file - everything works identically on different hardware.
</p>

<p>
Now the STM guys lein on this CMSIS mechanism to write their whole LL-API. You maybe noticed that we didn't do any chip configuration/selection in the previous section - it was all just one library for the whole F1 group of chips. If you open up the LL headers you will see that they all include a certain file <code>stm32f1xx.h</code> - and this is in a sense the entry point to the CMSIS for the LL-API. This include acts as a sort of "switch" which engages the correct configuration file for our particular chip for the CMSIS. The actual file is at <code>CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h</code>. It's really short - so just open it up and at the top you will see a big ugly table where you can find the preprocessor switch values that you will use. Once we set this value the correct configuration file gets included and everything simply works across the whole LL
</p>

<p>
B/c the <b>bluepill</b> uses a <code>STM32F103C8T6</code>, this maps to a proprocessor value of <code>STM32F103xB</code> (you can find the actual config file as well if you want to take a look at it). I will provide this value by default in CMake, but any user of this library can provide another value; either on the command line when running cmake with <code>cmake -DSTM32_DEVICE_GROUP=XXX</code> or more properly when included from a parent CMakeLists.txt with <code>set(STM32_DEVICE_GROUP XXX CACHE STRING "Selected device group")</code>
</p>


<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #006699;">set</span>(STM32_DEVICE_GROUP <span style="color: #008000;">"STM32F103xB"</span> CACHE STRING
 <span style="color: #008000;">"Chip configuration as defined in stm32f1xx.h (default value for the bluepill)"</span>)

<span style="color: #006699;">target_compile_definitions</span>(ll PUBLIC ${<span style="color: #BA36A5;">STM32_DEVICE_GROUP</span>})
<span style="color: #006699;">target_compile_definitions</span>(ll PUBLIC <span style="color: #008000;">"USE_FULL_LL_DRIVER"</span>)
<span style="color: #006699;">target_include_directories</span>(ll PUBLIC CMSIS/Device/ST/STM32F1xx/Include)
</pre>
</div>

<p>
The very last step is to include the actual CMSIS itself which is simply in <code>CMSIS/Include</code> and to tell the compiler the target ARM architecture.
</p>

<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #006699;">target_include_directories</span>(ll PUBLIC CMSIS/Include)
<span style="color: #006699;">target_compile_options</span>(ll PUBLIC
  -mthumb
  -mcpu=cortex-m3
  -mfloat-abi=soft
  -mlittle-endian)
</pre>
</div>

<p>
<b>Note:</b> The CMSIS folder is pretty huge.. It's over 60MB. Even stripped of most things it is over 10MB in size. However, <code>git</code> seems to compress it pretty easily
</p>

<p>
<b>Note:</b> This repository was made on <code>2018-08-18</code>. I make no promises about keeping it up to date with newer updates of the LL-API and CMSIS
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: George Kontsevich</p>
<p class="date">Created: 2019-07-25 Thu 11:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
